{
  "backend/main.mo": "Motoko canister implementing user profiles, user stats, channel status tracking, and access‑controlled admin/user operations.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Plain-text summaries describing the purpose of key frontend components, hooks, styles, and configuration files.",
  "frontend/index.html": "HTML entry point setting PWA metadata, icons, orientation lock styles, and loading the React app root.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, icons, and portrait-only orientation settings.",
  "frontend/public/service-worker.js": "Service worker providing GPRS-optimized caching with strict rules to avoid caching radio streams and external APIs.",
  "frontend/src/App.tsx": "Main React app container managing stations, audio playback, overlays, orientation lock, and global providers.",
  "frontend/src/components/AudioPlayer.tsx": "Complex audio player managing playback, retries, errors, and volume with events for parent integration.",
  "frontend/src/components/AudioSpectrumAnalyzer.tsx": "Canvas-based audio spectrum visualizer using Web Audio API with animated frequency bars.",
  "frontend/src/components/BlinkingStars.tsx": "Three.js component rendering many procedurally generated blinking stars with twinkling animation.",
  "frontend/src/components/DayNightToggle.tsx": "Empty placeholder component file.",
  "frontend/src/components/DistantPlanets.tsx": "Empty placeholder component file.",
  "frontend/src/components/DonationModal.tsx": "Modal for displaying crypto donation addresses with copy-to-clipboard UI and color‑themed blocks.",
  "frontend/src/components/Earth.tsx": "Empty placeholder component file.",
  "frontend/src/components/EarthScene.tsx": "Empty placeholder component file.",
  "frontend/src/components/FmRadioCenterOverlay.tsx": "Centered overlay displaying a semi‑transparent FM Radio logo.",
  "frontend/src/components/Footer.tsx": "Fixed bottom footer showing the developer credit with gradient text styling.",
  "frontend/src/components/Header.tsx": "Empty placeholder component file.",
  "frontend/src/components/LoadingScreen.tsx": "Fullscreen loading screen with animated radio icon, text, bouncing dots, and PWA hints.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Logic and UI for prompting users to install the PWA, with deferred install handling and dismissal rules.",
  "frontend/src/components/RadioPin.tsx": "Empty placeholder component file.",
  "frontend/src/components/RadioPins.tsx": "Empty placeholder component file.",
  "frontend/src/components/RadioPlaybackDisplay.tsx": "Displays the currently playing station, manages bookmarks in localStorage, and shows country flags with fallback mappings.",
  "frontend/src/components/SearchOverlay.tsx": "Provides a full-screen search overlay that filters stations by multiple fields and allows selection.",
  "frontend/src/components/SpaceScene.tsx": "Renders a simple space background with blinking stars using React Three Fiber.",
  "frontend/src/components/StationCounter.tsx": "Empty placeholder component file.",
  "frontend/src/components/Tagline.tsx": "Empty placeholder component file.",
  "frontend/src/components/TopToolbar.tsx": "Implements the main toolbar with search, dashboard, login, refresh, and station selection controls.",
  "frontend/src/components/UserDashboard.tsx": "Displays user dashboard with bookmarked stations and channel statistics, syncing bookmarks from localStorage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, including login, logout, stored identity handling, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Implements multi-layer caching, IndexedDB storage, and lazy batch loading for radio stations with utilities to clear caches and manage fetch state.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode settings, portrait-orientation locking, glow utilities, and global transitions.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and mounts the root component.",
  "frontend/src/serviceWorkerRegistration.ts": "Handles service worker registration, update detection, and unregister logic for PWA offline support.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions such as colors, radii, shadows, and animations, and sets file content paths.",
  "PACKAGING_GUIDE.md": "Explains how to assemble a distributable ZIP for Global FM, listing required directories, required files, and items to exclude.",
  "project_state.json": "Describes the project architecture, features, known issues, and current state metadata for Global FM.",
  "README.md": "Overview of Global FM’s 3D globe radio app with features such as interactive Earth rendering, radio playback, and user dashboard.",
  "SETUP_INSTRUCTIONS.md": "Provides a short guide for installing prerequisites and running Global FM locally.",
  "unknown.txt": "Contains support guidance for packaging issues and a brief footer attribution."
}