{
  "backend/main.mo": "Motoko canister implementing user profiles, statistics, channel status management, and access‑controlled admin/user actions.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend source files and components.",
  "frontend/index.html": "Base HTML document configuring metadata, PWA settings, icons, and orientation locking for the frontend app.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, colors, orientation, and categories.",
  "frontend/public/service-worker.js": "Service worker implementing GPRS‑optimized caching for static assets, runtime caching, and network rules for radio streams.",
  "frontend/src/App.tsx": "Main app component initializing React Query, themes, audio and station state, orientation locking, and lazy-loaded 3D scene.",
  "frontend/src/components/AudioPlayer.tsx": "Audio player handling playback, retries, errors, volume, and emitting playback state via callbacks.",
  "frontend/src/components/AudioSpectrumAnalyzer.tsx": "Canvas-based audio spectrum visualizer using Web Audio API with responsive sizing and smooth animations.",
  "frontend/src/components/BlinkingStars.tsx": "Three.js component rendering blinking, animated starfield with randomized positions and twinkle effects.",
  "frontend/src/components/DayNightToggle.tsx": "Empty placeholder component.",
  "frontend/src/components/DistantPlanets.tsx": "Empty placeholder component.",
  "frontend/src/components/DonationModal.tsx": "Modal showing donation addresses with themed blocks and copy-to-clipboard interaction.",
  "frontend/src/components/Earth.tsx": "Empty placeholder component.",
  "frontend/src/components/EarthScene.tsx": "Empty placeholder component.",
  "frontend/src/components/FmRadioCenterOverlay.tsx": "Empty placeholder component.",
  "frontend/src/components/Footer.tsx": "Footer component displaying developer credit with gradient text.",
  "frontend/src/components/Header.tsx": "Empty placeholder component.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading UI with animated radio icon, text, and bouncing indicators.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Manages a deferred PWA install prompt with timed display, dismissal persistence, and install handling.",
  "frontend/src/components/RadioPin.tsx": "Empty component file.",
  "frontend/src/components/RadioPins.tsx": "Empty component file.",
  "frontend/src/components/RadioPlaybackDisplay.tsx": "Displays current station info, flag, share button, and bookmark controls for a playing station.",
  "frontend/src/components/RadioTowerOverlay.tsx": "Renders animated radio‑wave rings and a radio tower icon overlay.",
  "frontend/src/components/SearchOverlay.tsx": "Full‑screen searchable station list with filtering, keyboard handling, and selection UI.",
  "frontend/src/components/SpaceScene.tsx": "Three.js scene component rendering a black background and blinking stars.",
  "frontend/src/components/StationCounter.tsx": "Empty component file.",
  "frontend/src/components/Tagline.tsx": "Empty component file.",
  "frontend/src/components/TopToolbar.tsx": "Toolbar for search, login, refresh, and donation actions, integrating station loading and identity management.",
  "frontend/src/components/UserDashboard.tsx": "User dashboard showing bookmarks, session state, and statistics with escape/backdrop handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useBookmarks.ts": "Manages bookmark IDs using localStorage and a custom event to sync state across components.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity login, stored identities, and login status handling.",
  "frontend/src/hooks/useQueries.ts": "Implements multi‑layer caching and IndexedDB storage for radio station data with lazy loading and cache‑clearing utilities.",
  "frontend/src/index.css": "Tailwind setup with theme variables, dark mode, portrait‑lock behavior, glow utilities, and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/serviceWorkerRegistration.ts": "Registers and manages the service worker for PWA offline support and update handling.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session‑based parameters, including hash‑route support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, border radii, glow shadows, and animation keyframes for UI effects including accordions, fades, slides, and signal waves.",
  "PACKAGING_GUIDE.md": "Guide describing which project folders and files to include or exclude when creating a distributable ZIP package.",
  "project_state.json": "Describes the project's architecture, features, known issues, and state metadata for a global radio streaming PWA with React, R3F, and a Motoko backend.",
  "README.md": "Project overview describing the 3D globe radio app, its main features, and high-level structure.",
  "SETUP_INSTRUCTIONS.md": "Quick setup guide outlining prerequisites and steps to run Global FM locally.",
  "unknown.txt": "Provides support tips for packaging issues and includes a brief footer note."
}