{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, user statistics, and channel status APIs.",
  "feature_evidence.json": "Feature evidence report mapping Christian-station features to code files, components, and tests.",
  "frontend-file-summaries.txt": "List of frontend file summaries describing component responsibilities and features.",
  "frontend/index.html": "Main HTML document configuring PWA metadata, icons, orientation lock, and app bootstrap.",
  "frontend/public/manifest.json": "PWA manifest defining icons, metadata, and portrait orientation for the app.",
  "frontend/public/service-worker.js": "Service worker implementing GPRS‑optimized caching, runtime cache cleanup, and network rules.",
  "frontend/src/App.tsx": "Main React app wiring queries, 3D scene, playback UI, PWA prompt, and orientation-lock logic.",
  "frontend/src/components/AudioPlayer.tsx": "Audio player component that manages streaming playback with reconnect logic, volume control, and play/pause handling.",
  "frontend/src/components/BlinkingStars.tsx": "Renders an animated starfield using three.js with blinking and twinkling effects.",
  "frontend/src/components/DayNightToggle.tsx": "Empty placeholder file.",
  "frontend/src/components/DistantPlanets.tsx": "Empty placeholder file.",
  "frontend/src/components/DonationModal.tsx": "Donation modal with crypto addresses and copy-to-clipboard functionality using themed UI blocks.",
  "frontend/src/components/Earth.tsx": "Empty placeholder file.",
  "frontend/src/components/EarthScene.tsx": "Empty placeholder file.",
  "frontend/src/components/Footer.tsx": "Static footer displaying developer attribution with gradient text styling.",
  "frontend/src/components/Header.tsx": "Empty placeholder file.",
  "frontend/src/components/LoadingScreen.tsx": "Full‑screen loading UI with animated radio icon, bouncing dots, and informational text.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Manages showing and handling the PWA install prompt with deferred events and dismissal logic.",
  "frontend/src/components/RadioPin.tsx": "Empty placeholder file.",
  "frontend/src/components/RadioPins.tsx": "Empty placeholder file.",
  "frontend/src/components/RadioPlaybackDisplay.tsx": "Displays current station metadata with flag, share, and bookmark handling stored in localStorage.",
  "frontend/src/components/SearchOverlay.tsx": "Search overlay component that filters stations by query and displays results with escape-key handling and UI interactions.",
  "frontend/src/components/SpaceScene.tsx": "Memoized component that renders a black background and blinking stars for a space-themed scene.",
  "frontend/src/components/StationCounter.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/Tagline.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/TopToolbar.tsx": "Top toolbar providing search, refresh, login, and dashboard controls while managing station refresh and identity state.",
  "frontend/src/components/UserDashboard.tsx": "User dashboard overlay showing bookmarked stations, channel stats, and escape-key handling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity provider and hook handling login, logout, identity persistence, and auth-client configuration.",
  "frontend/src/hooks/useQueries.ts": "Query utilities and caching layers for fetching global radio stations with memory, localStorage, and IndexedDB caching plus clear functions.",
  "frontend/src/index.css": "Tailwind base layers with extensive CSS variables, global styles, orientation locking, and custom animated title styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/serviceWorkerRegistration.ts": "Implements service worker registration, validation, update handling, and unregistration for PWA support.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Extends Tailwind with custom colors, radii, shadows, and animations mapped to CSS variable–driven theming.",
  "PACKAGING_GUIDE.md": "Instructions for creating a ZIP distribution, listing required directories/files and exclusions.",
  "project_state.json": "Project metadata describing architecture, features, known issues, and implementation notes for the Gracy FM app.",
  "README.md": "Overview of Global FM’s 3D globe radio app with feature list and project description.",
  "SETUP_INSTRUCTIONS.md": "Short guide for installing prerequisites and running the app locally.",
  "unknown.txt": "Support tips for packaging issues plus a brief project credit."
}