{
  "backend/main.mo": "Motoko canister providing access control, user profiles, user statistics, and channel status management APIs.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-like list summarizing all frontend components, hooks, and configurations with detailed behavior notes.",
  "frontend/index.html": "Main HTML entry configuring PWA behavior, icons, portrait lock styling, and loading the React app.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, colors, categories, and enforced portrait orientation.",
  "frontend/public/service-worker.js": "Service worker implementing GPRS-optimized caching for static assets with network-first logic for HTML and strict no-cache rules for streams.",
  "frontend/src/App.tsx": "Primary React app managing station state, orientation lock, auto-play, queries, and centered overlays for tower and spectrum analyzer.",
  "frontend/src/components/AudioPlayer.tsx": "Custom audio player with streaming retry logic, play/pause handling, volume control, and event listeners for updating playback state.",
  "frontend/src/components/AudioSpectrumAnalyzer.tsx": "Canvas-based audio spectrum visualizer using Web Audio API with animated frequency bars and responsive initialization.",
  "frontend/src/components/BlinkingStars.tsx": "Three.js component rendering animated blinking starfield with per-star twinkle behavior.",
  "frontend/src/components/DayNightToggle.tsx": "Empty placeholder component file.",
  "frontend/src/components/DistantPlanets.tsx": "Empty placeholder component file.",
  "frontend/src/components/DonationModal.tsx": "Modal UI for crypto donation addresses with copy-to-clipboard support and styled address blocks.",
  "frontend/src/components/Earth.tsx": "Empty placeholder component file.",
  "frontend/src/components/EarthScene.tsx": "Empty placeholder component file.",
  "frontend/src/components/FmRadioCenterOverlay.tsx": "Empty placeholder component file.",
  "frontend/src/components/Footer.tsx": "Displays fixed footer with gradient text crediting the app developer.",
  "frontend/src/components/Header.tsx": "Empty placeholder component file.",
  "frontend/src/components/LoadingScreen.tsx": "Loading overlay with animated radio icon, bounce indicators, and informational text.",
  "frontend/src/components/PWAInstallPrompt.tsx": "Manages custom PWA install prompt behavior with delayed showing, dismissal tracking, and install handling.",
  "frontend/src/components/RadioPin.tsx": "Empty placeholder component file.",
  "frontend/src/components/RadioPins.tsx": "Empty placeholder component file.",
  "frontend/src/components/RadioPlaybackDisplay.tsx": "Component showing current station info, country flag, and bookmark controls using localStorage.",
  "frontend/src/components/RadioTowerOverlay.tsx": "Visual overlay rendering animated radio signal waves and a radio tower icon.",
  "frontend/src/components/SearchOverlay.tsx": "Search modal that filters and displays stations with keyboard handling and selection callbacks.",
  "frontend/src/components/SpaceScene.tsx": "Three.js background scene with black space and blinking stars.",
  "frontend/src/components/StationCounter.tsx": "Empty file.",
  "frontend/src/components/Tagline.tsx": "Empty file.",
  "frontend/src/components/TopToolbar.tsx": "Top navigation bar enabling search, refresh, login/logout, and station selection.",
  "frontend/src/components/UserDashboard.tsx": "User dashboard modal showing bookmarked stations and basic channel stats.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching an authenticated or anonymous backend actor and invalidating queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks managing Internet Identity auth, login flow, stored identity, and provider setup.",
  "frontend/src/hooks/useQueries.ts": "Implements multi-layer caching, IndexedDB storage, and lazy batch loading for radio stations with utilities to clear all caches. Defines station types and manages memory, localStorage, and IndexedDB caches optimized for slow networks.",
  "frontend/src/index.css": "Tailwind base styles with light/dark CSS variables plus forced portrait orientation behavior. Adds glow utilities, modal scrolling tweaks, and global transition settings.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider. Loads global styles and renders the root App component.",
  "frontend/src/serviceWorkerRegistration.ts": "Handles service worker registration with update handling and localhost validation. Provides helpers to register, unregister, and check worker validity for PWA support.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read, store, persist, and clear URL parameters using query strings, hashes, and sessionStorage. Includes helper to remove parameters from the hash without reloading.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom color variables, radii, shadows, and animation keyframes. Scans project files for class usage and enables class-based dark mode.",
  "PACKAGING_GUIDE.md": "Instructions for creating a distributable ZIP package, listing required directories/files and items to exclude.",
  "project_state.json": "Describes the project architecture, features, caching strategy, known issues, and frontend/backend structure. Serves as metadata for the Global FM application development state.",
  "README.md": "Overview of the Global FM app, its features, and project purpose with a brief project structure intro.",
  "SETUP_INSTRUCTIONS.md": "Quick-start guide outlining prerequisites and initial steps to run Global FM locally.",
  "unknown.txt": "Provides support notes for packaging issues and includes a short credit footer."
}