{
  "kind": "build_request",
  "title": "Fix audio spectrum analyzer reactivity and restore centered FM radio symbol",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Fix the AudioSpectrumAnalyzer so it reacts to the actual currently playing radio stream audio output (frequency bars move while audio is playing), rather than staying idle.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Audio spectrum analyser is not working according to audio, not Even any reaction."
        ]
      },
      "acceptanceCriteria": [
        "When a station is playing, the spectrum bars visibly animate in sync with audio within 1 second of playback starting.",
        "When playback is paused/stopped (or no station selected), the analyzer renders an idle state and does not appear frozen.",
        "The analyzer initialization does not fail due to missing audio element (the analyzer can reliably access the app’s audio element).",
        "Web Audio initialization respects browser autoplay policies (AudioContext resumes only after a user gesture) and does not spam console errors.",
        "No regressions to streaming playback (audio still plays reliably with existing reconnection logic)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Restore the centered FM radio symbol/sign in the main display overlay (the radio icon that existed before the spectrum analyzer replacement), and ensure it is visible in the center of the screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Kindly place back FM radio symbol Sign"
        ]
      },
      "acceptanceCriteria": [
        "The center overlay shows an FM/radio symbol in the middle of the main screen.",
        "The restored icon overlay does not block user interactions (pointer-events remain non-interactive as appropriate).",
        "The visual result is consistent in both light/dark themes used by the app."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Update AppContent (frontend/src/App.tsx) so the center overlay behavior is consistent with the restored FM radio symbol and the analyzer fix (no broken or unused center-overlay code remains).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Kindly place back FM radio symbol Sign"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/App.tsx no longer renders a broken/non-reactive analyzer as the only center overlay.",
        "TypeScript build passes cleanly with no unused imports/variables introduced by the overlay change.",
        "The app still renders the 3D background scene and all existing UI elements (TopToolbar, RadioPlaybackDisplay, AudioPlayer, PWAInstallPrompt, Toaster)."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (shadcn/ui) since they are read-only and must be composed, not edited.",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor; no additional backend services."
  ],
  "nonGoals": [
    "Adding new backend APIs or changing Motoko stable state for this task.",
    "Adding new third-party audio/visualization libraries; use existing Web Audio + canvas approach already in the codebase.",
    "Changing station fetching, caching, or Christian/Hindi station prioritization behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}