{
  "kind": "build_request",
  "title": "Enable guest dashboard access + ensure guest bookmarking persists, and finalize spectrum analyzer 10-bar edge-to-edge layout",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Update the AudioSpectrumAnalyzer visualization to render a maximum of 10 total bars (mirrored 5 left + 5 right) with reduced individual bar width and a dynamic bar-width-to-gap ratio such that the mirrored bars fill 100% of the horizontal screen width edge-to-edge (no intentional left/right padding), while preserving the existing center-out mirrored layout and grayscale-only styling.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Apply these changes and  also fix this 👉 The spectrum‑analyzer update is fully valid. I can add: max 10 bars, reduced bar width, and dynamic bar/spacing ratio so the full horizontal width is filled edge‑to‑edge."
        ]
      },
      "acceptanceCriteria": [
        "When audio is playing, the spectrum analyzer shows no more than 10 bars total, symmetrically mirrored from the center axis.",
        "Bar width is visibly reduced compared to the current implementation, and spacing is computed dynamically so the full set of mirrored bars spans the entire canvas width edge-to-edge (no 95% width or similar padding).",
        "The analyzer remains grayscale-only (no color palettes, glow, or gradients)."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Fix AudioSpectrumAnalyzer canvas sizing/resize behavior so the drawing scale is correct after initial load and after window resizes (avoid cumulative canvas context scaling across multiple resize calls), and ensure the visualization continues to animate smoothly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "Resizing the window does not cause the bars to become stretched/compressed incorrectly or progressively scaled due to repeated ctx.scale calls.",
        "The analyzer continues rendering smoothly (no flicker/jitter introduced by resizing)."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Allow unauthenticated (guest/anonymous) users to open and use the User Dashboard overlay with limited privileges (read-only / local-only), instead of blocking access behind Internet Identity login.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "If the proposed authentication upgrade cannot be implemented, the system should allow unauthenticated (guest) users to access the dashboard module with limited privileges."
        ]
      },
      "acceptanceCriteria": [
        "Clicking the Dashboard button opens the User Dashboard even when not logged in.",
        "Dashboard contents for guests are limited to locally available information (e.g., local bookmarks and station-derived counts) and do not require any authenticated backend calls.",
        "Any existing authenticated-only actions (if present elsewhere) remain protected and continue to require Internet Identity."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Ensure channel/station bookmarking works for non-authenticated (guest) users and persists locally across sessions using device-level storage (continue using the existing localStorage/IndexedDB approach already present in the app), and ensure the dashboard reflects guest bookmarks correctly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Additionally, enable channel bookmarking functionality for non-authenticated users. Bookmarked data should be persisted locally using device-level storage (e.g., local storage, IndexedDB, or secure app storage), ensuring state retention across sessions within the application environment"
        ]
      },
      "acceptanceCriteria": [
        "A guest user can bookmark/unbookmark a station from the playback UI, and the bookmark state persists after page reload.",
        "Opening the User Dashboard as a guest shows the correct bookmarked stations list based on locally stored bookmarks.",
        "No new authentication providers (Google OAuth, MetaMask, Trust Wallet, Binance Wallet) are added; bookmarking remains functional without login."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/immutablePaths must not be edited (compose existing components/hooks instead).",
    "Backend must remain single-actor (all Motoko logic in backend/main.mo).",
    "Do not add third-party authentication providers (only Internet Identity is supported)."
  ],
  "nonGoals": [
    "Implementing Google (OAuth 2.0) login.",
    "Implementing MetaMask/Trust Wallet/Binance Wallet login or any global wallet discovery feature.",
    "Adding server-side persistence for guest bookmarks (guest bookmarks must remain device-local)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}