{
  "kind": "build_request",
  "title": "Center the spectrum analyzer and replace the FM logo with an animated radio-tower symbol",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Move the AudioSpectrumAnalyzer overlay so it is visually centered in the middle of the screen (remove any extra offset that pushes it downward), while keeping it centered horizontally and vertically above the 3D scene.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Shift the audio spectrum analyzer to the middle of the screen from the bottom."
        ]
      },
      "acceptanceCriteria": [
        "On common mobile viewport sizes, the spectrum analyzer renders centered in the screen (not near the bottom).",
        "The analyzer remains non-interactive (pointer-events do not block interactions with other UI).",
        "No layout regressions occur for TopToolbar, playback display, or audio player UI."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Remove the centered FM logo overlay from the main display (stop rendering the existing FmRadioCenterOverlay and ensure the FM logo image is no longer shown in the center of the screen).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Remove the FM logo and replace it with only a radio tower symbol and place it above the spectrum analyser."
        ]
      },
      "acceptanceCriteria": [
        "The FM logo image is not visible anywhere in the centered main display overlay area during normal app usage.",
        "No unused imports/components remain related to the removed centered FM overlay (project builds cleanly without unused-variable/type errors)."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Add a centered radio-tower symbol with animated signal waves and place it directly above the centered AudioSpectrumAnalyzer, aligned to the same center axis.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Tower with animated signal waves"
        ]
      },
      "acceptanceCriteria": [
        "A radio-tower symbol is visible above the spectrum analyzer in the center of the screen.",
        "The symbol includes animated signal waves (continuous, clearly noticeable animation).",
        "The tower + waves animation performs smoothly and does not noticeably degrade rendering performance on mobile devices.",
        "The tower symbol does not intercept pointer events (pointer-events: none)."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Update the center-overlay composition in frontend/src/App.tsx so the radio-tower symbol and the AudioSpectrumAnalyzer are arranged as a single centered vertical stack (tower above analyzer), and remove any now-obsolete center-overlay code paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-9"
        ],
        "quotes": [
          "Shift the audio spectrum analyzer to the middle of the screen from the bottom.",
          "Tower with animated signal waves"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/App.tsx uses a single centered container for the tower-above-analyzer layout.",
        "The analyzer remains connected to the current audio element and continues to render as before, only repositioned.",
        "No broken/unused center overlay components remain referenced by AppContent."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not introduce additional backend services or databases; keep changes in the existing React + TypeScript frontend.",
    "Keep the Internet Computer single-actor backend architecture unchanged (no backend changes required for this request)."
  ],
  "nonGoals": [
    "Changing station fetching, caching, or prioritization behavior.",
    "Changing audio playback/reconnection behavior beyond what is necessary to reposition overlays.",
    "Adding new authentication providers or third-party integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}