{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Center the spectrum analyzer and replace FM logo with animated radio-tower overlay",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Reposition the AudioSpectrumAnalyzer overlay to be visually centered on screen (remove downward offset) while remaining non-interactive.",
      "acceptanceCriteria": [
        "On common mobile viewport sizes, the spectrum analyzer renders centered in the screen (not near the bottom).",
        "The analyzer remains non-interactive (pointer-events do not block interactions with other UI).",
        "No layout regressions occur for TopToolbar, playback display, or audio player UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust the center-overlay container styling to remove the extra downward offset (e.g., eliminate the current margin-top) while keeping the analyzer centered via absolute positioning and transforms; ensure the overlay wrapper remains pointer-events-none and does not affect TopToolbar/RadioPlaybackDisplay/AudioPlayer layout."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Remove the centered FM logo overlay from the main display and clean up related references.",
      "acceptanceCriteria": [
        "The FM logo image is not visible anywhere in the centered main display overlay area during normal app usage.",
        "No unused imports/components remain related to the removed centered FM overlay (project builds cleanly without unused-variable/type errors)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Stop rendering the existing centered FM overlay by removing the FmRadioCenterOverlay import and JSX usage, ensuring there are no remaining references."
        },
        {
          "path": "frontend/src/components/FmRadioCenterOverlay.tsx",
          "operation": "delete",
          "description": "Delete the obsolete centered FM overlay component so the FM logo image is no longer used and no dead code remains."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Add a centered animated radio-tower symbol with signal waves above the spectrum analyzer, aligned to the same center axis and non-interactive.",
      "acceptanceCriteria": [
        "A radio-tower symbol is visible above the spectrum analyzer in the center of the screen.",
        "The symbol includes animated signal waves (continuous, clearly noticeable animation).",
        "The tower + waves animation performs smoothly and does not noticeably degrade rendering performance on mobile devices.",
        "The tower symbol does not intercept pointer events (pointer-events: none)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RadioTowerOverlay.tsx",
          "operation": "create",
          "description": "Create a lightweight React component that renders a radio-tower symbol (prefer SVG or simple divs) with animated signal waves using transform/opacity animations; ensure the root is pointer-events-none and is sized appropriately for mobile."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind animations/keyframes to support smooth, GPU-friendly signal-wave and subtle tower pulse animations (transform/opacity only) that can be applied by RadioTowerOverlay."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Update App center-overlay composition to a single centered vertical stack (tower above analyzer) and remove obsolete center-overlay code paths.",
      "acceptanceCriteria": [
        "frontend/src/App.tsx uses a single centered container for the tower-above-analyzer layout.",
        "The analyzer remains connected to the current audio element and continues to render as before, only repositioned.",
        "No broken/unused center overlay components remain referenced by AppContent."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor the center overlay into one absolute, screen-centered container that renders a vertical stack: RadioTowerOverlay above AudioSpectrumAnalyzer; keep pointer-events-none on the container, preserve the analyzer props wiring (audioElement/isPlaying/userInteracted), and remove any now-obsolete centered overlay JSX."
        }
      ]
    }
  ]
}