{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Guest dashboard + persistent guest bookmarks + 10-bar edge-to-edge spectrum analyzer",
  "requirements": [
    {
      "id": "REQ-27",
      "summary": "Update AudioSpectrumAnalyzer to a maximum of 10 total mirrored bars and compute dynamic bar/gap sizing to fill the full canvas width edge-to-edge while keeping center-out mirrored grayscale styling.",
      "acceptanceCriteria": [
        "When audio is playing, the spectrum analyzer shows no more than 10 bars total, symmetrically mirrored from the center axis.",
        "Bar width is visibly reduced compared to the current implementation, and spacing is computed dynamically so the full set of mirrored bars spans the entire canvas width edge-to-edge (no 95% width or similar padding).",
        "The analyzer remains grayscale-only (no color palettes, glow, or gradients)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AudioSpectrumAnalyzer.tsx",
          "operation": "modify",
          "description": "Adjust the spectrum rendering math to draw exactly 5 bars per side (10 total), reduce individual bar width, and compute bar width + inter-bar gap so that the outermost left/right bars align with the canvas edges (no intentional horizontal padding) while preserving the existing mirrored-from-center layout and grayscale-only fill styles."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Fix AudioSpectrumAnalyzer resize behavior to avoid cumulative canvas context scaling and keep animation smooth on initial load and window resizes.",
      "acceptanceCriteria": [
        "Resizing the window does not cause the bars to become stretched/compressed incorrectly or progressively scaled due to repeated ctx.scale calls.",
        "The analyzer continues rendering smoothly (no flicker/jitter introduced by resizing)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AudioSpectrumAnalyzer.tsx",
          "operation": "modify",
          "description": "Update the responsive canvas sizing logic to reset the 2D context transform before applying devicePixelRatio scaling (e.g., using setTransform/resetTransform) so repeated resizes do not compound scaling; ensure the animation loop remains stable and continues to render smoothly after resize."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Allow guest (unauthenticated) users to open and use the User Dashboard overlay in a local-only, limited mode instead of blocking behind Internet Identity login.",
      "acceptanceCriteria": [
        "Clicking the Dashboard button opens the User Dashboard even when not logged in.",
        "Dashboard contents for guests are limited to locally available information (e.g., local bookmarks and station-derived counts) and do not require any authenticated backend calls.",
        "Any existing authenticated-only actions (if present elsewhere) remain protected and continue to require Internet Identity."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TopToolbar.tsx",
          "operation": "modify",
          "description": "Remove the authentication gating for opening the dashboard: always allow the Dashboard button to open the overlay for guests, and pass an explicit authentication/guest flag to the dashboard as needed for guest-mode UI messaging while keeping login/logout behavior unchanged."
        },
        {
          "path": "frontend/src/components/UserDashboard.tsx",
          "operation": "modify",
          "description": "Add support for a guest/unauthenticated display mode (driven by a prop from TopToolbar) that clearly keeps the dashboard read-only/local-only and avoids any authenticated backend-dependent behavior."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Ensure guest station bookmarking persists locally across sessions and the dashboard reflects guest bookmarks correctly.",
      "acceptanceCriteria": [
        "A guest user can bookmark/unbookmark a station from the playback UI, and the bookmark state persists after page reload.",
        "Opening the User Dashboard as a guest shows the correct bookmarked stations list based on locally stored bookmarks.",
        "No new authentication providers (Google OAuth, MetaMask, Trust Wallet, Binance Wallet) are added; bookmarking remains functional without login."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBookmarks.ts",
          "operation": "create",
          "description": "Create a small bookmarks hook/utility that encapsulates the existing device-local persistence (localStorage) for bookmark IDs and exposes read/toggle helpers plus a lightweight subscription mechanism (e.g., via a custom window event) so multiple UI surfaces can stay in sync without requiring authentication."
        },
        {
          "path": "frontend/src/components/RadioPlaybackDisplay.tsx",
          "operation": "modify",
          "description": "Refactor bookmark read/write logic to use the shared bookmarks hook so guest bookmarking remains device-local, persists across sessions, and emits a change notification that other components (like the dashboard) can react to while open."
        },
        {
          "path": "frontend/src/components/UserDashboard.tsx",
          "operation": "modify",
          "description": "Update the dashboard’s bookmark loading to use the shared bookmarks hook and subscribe to bookmark changes so the bookmarked stations list stays accurate for guests (including updates while the overlay is open), based solely on locally stored bookmark IDs."
        }
      ]
    }
  ]
}