{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Merge Christian (Hindi/English) Radio Browser stations into existing global station list with resilient fetch and caching",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Fetch Christian-tag (Hindi/English) stations and merge them into the existing global station list without removing or altering previously available stations.",
      "acceptanceCriteria": [
        "When loading stations, the returned list includes all previously available global stations plus additional stations sourced from the \"christian\" tag feed.",
        "No existing station is removed from the list as a result of adding the new Christian-tag stations (the station count should stay the same or increase, never decrease, given identical upstream data).",
        "Christian-tag stations are filtered to languages that include \"hindi\" or \"english\" (case-insensitive), matching the user-provided logic.",
        "The app remains functional with existing features (search, bookmarks, playback, refresh) using the merged station list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Extend the station loading pipeline to also fetch the Radio Browser by-tag feed for tag \"christian\", filter stations to languages containing \"hindi\" or \"english\" (case-insensitive), and merge the results into the existing global station list by appending only new stations (dedupe by stationuuid) so no previously available station is removed or replaced."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add server-failover fetching and station validity checks for Christian-tag stations consistent with the existing global station fetch and pin/globe requirements.",
      "acceptanceCriteria": [
        "If one Radio Browser server fails, the app attempts alternate servers before giving up on fetching the Christian-tag stations.",
        "Only stations with a usable stream URL (prefer url_resolved when available; otherwise fall back to url if needed) are added.",
        "The merged list does not introduce runtime errors in components that assume coordinates exist (e.g., globe/pins)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement a resilient Christian-tag fetch that uses the same multi-server failover list and request hardening (timeout/headers) as the global fetch; apply the same baseline validity expectations used elsewhere (must have valid coordinates via existing validation helper; must have usable stream URL by normalizing to url_resolved when present else url; ensure required fields used by UI like country are present) before merging to avoid runtime errors in station consumers."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Cache the merged station list using the existing multi-layer caching approach so Christian-tag stations persist across reloads and refreshes.",
      "acceptanceCriteria": [
        "After a normal reload (without clearing caches), Christian-tag stations remain present in the station list if they were previously fetched successfully.",
        "Using the existing Refresh action continues to work and results in a refreshed merged list that still includes Christian-tag stations.",
        "No new TypeScript/lint errors are introduced by the changes (project builds cleanly)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update caching write points (memory cache, localStorage, IndexedDB, and React Query cache updates during lazy loading and finalization) to store and serve the merged station list (global + validated Christian-tag additions). Ensure clearAllCaches also resets any in-memory Christian-tag fetch state so the existing Refresh action re-fetches a refreshed merged list without requiring changes elsewhere in the UI."
        }
      ]
    }
  ]
}